[
	{
	  "title": "Projects",
	  "projects": [
		{
		  "id": 1,
		  "name": "Portfolio",
		  "description": "Portfolio website showcasing my skills and projects",
		  "image": "portfolioimg.png",
		  "url": "https://kazikd.dev",
		  "longDescription": "My personal portfolio, built with React, Framer Motion and Vite for fast development. CI/CD is handled via Vercel, as with most of my other projects.",
		  "github": "https://github.com/kazikd11/portfolio"
		},
		{
		  "id": 2,
		  "name": "Easy Track",
		  "description": "Full-stack weight tracking mobile application",
		  "image": "easytrackimg.png",
		  "url": "https://easy-track-chi.vercel.app/",
		  "longDescription": "Deployed full-stack mobile app for tracking user weight. Designed as a production-ready product with a clean, layered architecture and proper separation of concerns, making it easy to scale and maintain. Google OAuth2 integration is fully implemented and tested, but currently disabled due to issues with Google Cloud Console configuration.",
		  "github": "https://github.com/kazikd11/Easy_Track"
		},
		{
		  "id": 3,
		  "name": "PyBet",
		  "description": "Machine learning powered betting assistant",
		  "image": "pybetimg.jpeg",
		  "longDescription": "PyBet is a group project utilizing Vue.js frontend and Django backend. It scrapes current football odds from Polish bookmaker websites and uses machine learning to identify profitable ones. I was responsible for leading the backend development team and writing unit tests.",
		  "github": "https://github.com/matadamczyk/PyBet"
		},
		{
		  "id": 4,
		  "name": "GetProxy",
		  "description": "Java-based proxy within an iframe",
		  "image": "proxyimg.png",
		  "url": "https://proxy-six-ivory.vercel.app/",
		  "longDescription": "Simple proxy that runs inside an iframe. Developed to bypass iframe navigation restrictions in modern browsers. Built with Spring Boot and a minimalistic React frontend. Backend is currently offline.",
		  "github": "https://github.com/kazikd11/Proxy"
		}
	  ]
	},
	{
	  "title": "University Projects",
	  "projects": [
		{
		  "id": 5,
		  "name": "Harmonic Motion Simulator",
		  "description": "Physics simulation with Node.js backend",
		  "image": "symulatorimg.png",
		  "url": "https://tehniki.vercel.app/",
		  "longDescription": "Simple front-end simulation of harmonic motion, connected to a Node.js backend. The backend allows for account creation, login, and settings storage. User sessions are maintained using cookies. Backend is currently offline.",
		  "github": "https://github.com/kazikd11/Tehniki"
		},
		{
		  "id": 6,
		  "name": "Mountain Trails Database",
		  "description": "MVC Spring Boot application",
		  "image": "mvcimg.png",
		  "longDescription": "This project is an MVC application built with Spring Boot. Although the UI is basic, the project helped me solidify my understanding of the MVC pattern and database connectivity in Spring. It uses Java, Spring Boot, Thymeleaf, and PostgreSQL. Backend is currently offline.",
		  "github": "https://github.com/kazikd11/MVC-jdbc"
		},
		{
		  "id": 7,
		  "name": "OCR Raider",
		  "description": "Basic OCR application with a custom algorithm",
		  "image": "ocrimg.png",
		  "url": "https://ocr-seven-pi.vercel.app/",
		  "longDescription": "OCR Raider is a full-stack project created as a team effort. It features a custom text recognition algorithm implemented in Python. Backend is currently offline.",
		  "github": "https://github.com/kazikd11/OCR"
		}
	  ]
	}
  ]
  
